tap "heroku/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Mozilla CA certificate store
brew "ca-certificates"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# GNU database manager
brew "gdbm"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Cryptography and SSL/TLS Toolkit
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Garbage collector for C and C++
brew "bdw-gc"
# High performance key/value database
brew "berkeley-db", link: true
# Extremely Fast Compression algorithm
brew "lz4"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Collection of portable C++ source libraries
brew "boost"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# HTTP/2 C Library
brew "libnghttp2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Generic library support script
brew "libtool"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# Git extensions to provide high-level repository operations (AVH edition merged into main)
brew "git-flow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Asynchronous event library
brew "libevent"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Development kit for the Java programming language
brew "openjdk"
# Java-based scripting language
brew "groovy"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Spell checker and morphological analyzer
brew "hunspell"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Image manipulation library
brew "jpeg"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Network authentication protocol
brew "krb5"
# Secure hashing function
brew "libb2"
# Asynchronous event library
brew "libev"
# Portable Foreign Function Interface library
brew "libffi"
# C library to parse Metalink XML files
brew "libmetalink"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Library for USB device access
brew "libusb-compat"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# YAML Parser
brew "libyaml"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Java-based project management
brew "maven"
# C Markdown parser. Fast. SAX-like interface
brew "md4c"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Scalable distributed version control system
brew "mercurial"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Install NodeJS versions
brew "node-build"
# Open source suite of directory software
brew "openldap"
# Perl compatible regular expressions library
brew "pcre"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# GNU Portable THreads
brew "pth"
# Cross-platform application and UI framework
brew "qt"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install various Ruby versions and implementations
brew "ruby-build"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Tool Command Language
brew "tcl-tk"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher", link: false
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# node.js dependency for heroku
brew "heroku/brew/heroku-node"
# Apple TV Aerial screensaver
cask "aerial"
# BitTorrent client
cask "deluge"
# Explore the Electron APIs
# Desktop client for GitHub repositories
cask "github"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# Free and open-source page layout program
cask "scribus"
# Application for inspecting installer packages
cask "suspicious-package"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Development environment
# Virtualiser for x86 hardware
# Multimedia player
cask "vlc"
# Quick Look plugin for webp files
cask "webpquicklook"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "alexdima.copy-relative-path"
vscode "andys8.jest-snippets"
vscode "anseki.vscode-color"
vscode "anthropic.claude-code"
vscode "arcanis.vscode-zipfs"
vscode "artisanbytecrafter.poptheme"
vscode "atelierbram.atelier-vscode-themes"
vscode "atelierbram.base2tone-vscode-themes"
vscode "atelierbram.base4tone-vscode-themes"
vscode "atishay-jain.all-autocomplete"
vscode "azemoh.one-monokai"
vscode "bajdzis.vscode-database"
vscode "be5invis.theme-railgun"
vscode "bernardodsanderson.theme-material-neutral"
vscode "bierner.color-info"
vscode "castwide.solargraph"
vscode "chirtlelovesdolls.nebula-theme"
vscode "christian-kohler.npm-intellisense"
vscode "connor4312.css-theme-completions"
vscode "craigmaslowski.erb"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "diryox.paper-tmtheme"
vscode "docker.docker"
vscode "dorelljames.enki-theme-vscode"
vscode "dotjoshjohnson.xml"
vscode "doublefint.pgsql"
vscode "dzannotti.vscode-babel-coloring"
vscode "eamodio.gitlens"
vscode "earshinov.permute-lines"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felipe-mendes.slack-theme"
vscode "fisheva.eva-theme"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gamunu.vscode-yarn"
vscode "gerane.theme-dimmed-monokai"
vscode "gerane.theme-peel"
vscode "gerane.theme-twostones"
vscode "gerane.theme-zenburn"
vscode "github.vscode-pull-request-github"
vscode "golf1052.base16-generator"
vscode "grapecity.gc-excelviewer"
vscode "hedinne.popping-and-locking-vscode"
vscode "heron.firefox-devtools-theme"
vscode "humao.rest-client"
vscode "idleberg.hopscotch"
vscode "idleberg.subway"
vscode "idleberg.subway-dark"
vscode "ionutvmi.path-autocomplete"
vscode "iwyvi.chinolor"
vscode "jeremyrajan.webpack"
vscode "joelday.docthis"
vscode "johnpapa.winteriscoming"
vscode "josef.rouge-theme"
vscode "joshpeng.sublime-babel-vscode"
vscode "jprestidge.theme-material-theme"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "keyring.lua"
vscode "kumar-harsh.graphql-for-vscode"
vscode "kuscamara.electron"
vscode "lkytal.flatui"
vscode "mariorodeghiero.vue-theme"
vscode "mariusschulz.yarn-lock-syntax"
vscode "marlon407.code-groovy"
vscode "maty.vscode-mocha-sidebar"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-csscomb"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.theme-1337"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vscode.theme-materialkit"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "oracle.mysql-shell-for-vs-code"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "poorchop.theme-darktooth"
vscode "qassimfarid.ejs-language-support"
vscode "ravasthi.rpa-css-snippets"
vscode "ravasthi.rpa-eslint-snippets"
vscode "ravasthi.rpa-javascript-snippets"
vscode "ravasthi.rpa-mocha-snippets"
vscode "ravasthi.rpa-scss-snippets"
vscode "ravasthi.rpa-stylelint-snippets"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rokoroku.vscode-theme-darcula"
vscode "rozbo.papercolor-vscode"
vscode "rprouse.theme-obsidian"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "salman-hasrat.jumptocolumn"
vscode "sean.macaroon-theme"
vscode "secanis.jenkinsfile-support"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "smlombardi.slime"
vscode "smukkekim.theme-setimonokai"
vscode "stylelint.vscode-stylelint"
vscode "sveggiani.vscode-field-lights"
vscode "tinkertrain.theme-panda"
vscode "tommorris.mako"
vscode "trixnz.vscode-lua"
vscode "ulysses.ulss"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "wingrunr21.vscode-ruby"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xshrim.txt-syntax"
vscode "yile-ou.paddy-color-theme"
vscode "yummygum.city-lights-theme"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
